# Querying MySQL DB Using Python & MySQLdb

Tutorial: [How to Insert Values into MySQL Table using Python](https://datatofish.com/insert-into-mysql-python/)

In [2]:
# import MySQLdb
import MySQLdb

In [3]:
# establish the DB connection using MySQLdb
db = MySQLdb.connect(
    host = 'localhost',
    user = 'root',
    password = '19974771',
    db='cat_app'
)

In [4]:
# est. cursor class to traverse the DB
cur = db.cursor()

In [5]:
# run the following query on your database
cur.execute('SELECT * FROM cat_app.cats')

7

In [7]:
# return all rows in DB
for row in cur.fetchall():
    print(row)

(1, 'Ringo', 'Tabby', 4)
(2, 'Cindy', 'Maine Coon', 10)
(3, 'Dumbledore', 'Maine Coon', 11)
(4, 'Egg', 'Persian', 4)
(5, 'Misty', 'Tabby', 13)
(6, 'George Michael', 'Ragdoll', 9)
(7, 'Jackson', 'Sphynx', 7)

In [23]:
db.close()

# Import Excel Data Into MySQL DB Using Python & SQL Alchemy

Tutorial: [Python Read Excel and Insert data to SQL](https://kanoki.org/2019/01/12/how-to-merge-multiple-csv-files-and-upload-to-mysql-or-postgressql-using-python/)

In [14]:
# import pandas & sqlalchemy
import pandas as pd
from sqlalchemy import create_engine

In [19]:
# read the csv and convert it to a pandas dataframe
df = pd.read_csv('test-cats.csv')

In [20]:
# show the spreadsheet as a dataframe
df

   cat_id  name  breed  age
0       8  Bill    NaN    7
1       9   Joe    NaN    6
2      10   Bob    NaN    5

In [21]:
# establish the connection to DB using sqlalchemy
engine = create_engine("mysql+mysqldb://root:"+'19974771'+"@localhost:3306/cat_app")

In [22]:
# use the to_sql function to insert csv rows into MySQL table
df.to_sql(name="cats", con=engine, if_exists='append',index=False)